<script setup lang="ts">
import { useRouter, useRoute } from "vue-router";
const router = useRouter();

</script>



<template>
  <div class="h-full pb-[100px]">
      <div class="container_oferta !p-3 !mb-3" style="background: none;">
        <button class="flex items-center" @click="router.back()">
          <span uk-icon="chevron-left" class="mr-2"></span>
          <span class="dark:text-[#fff]">{{ $t('return') }}</span>
        </button>
      </div>

     <div class="container_oferta  dark:bg-darkLayoutMain dark:text-[#fff]">
        <h1 class="dark:text-[#fff]">Публичная оферта</h1>

        <h3 class="dark:text-[#fff]">
          <p>ОБЩИЕ ПОЛОЖЕНИЯ</p>
          <p>1.1. Данный документ является официальной публичной офертой ООО «DOOKON.UZ»&nbsp;(в дальнейшем именуемого
            “Интернет магазин”) и содержит все существенные условия заказа, продажи и доставки товаров Покупателю.</p>
          <p><br></p>
          <p>1.3. В связи с вышеобъявленным, внимательно ознакомьтесь с текстом данной оферты и если Вы не согласны с ее
            условиями и правилами, или с каким-либо другим пунктом ее условий, ИНТЕРНЕТ МАГАЗИН предлагает Вам
            отказаться от заключения договора оферты и использовать услуги ИНТЕРНЕТ МАГАЗИНА, по средствам заключения
            прямого договора на оказание услуг.</p>
          <p><br></p>
          <p><br></p>
          <p>АКЦЕПТ ОФЕРТЫ И ЗАКЛЮЧЕНИЕ ДОГОВОРА ОФЕРТЫ</p>
          <p><br></p>
          <p>4.1. ПОКУПАТЕЛЬ производит Акцепт Оферты путем оплаты товара, что означает заключение договора розничной
            купли-продажи на условиях, изложенных в настоящей оферте. Договор считается заключенным с момента выдачи
            Покупателю кассового или товарного чека либо иного документа, подтверждающего оплату Товара, или с момента
            получения Продавцом сообщения о намерении Покупателя приобрести Товар.</p>
          <p><br></p>
          <p>ОПИСАНИЕ УСЛУГ</p>
          <p>5.1. Интернет-магазин является информационной системой для поиска, заказа и оплаты Товаров Покупателем,
            предлагаемых Продавцом.</p>
          <p><br></p>
          <p>5.2. В случае отсутствия заказанного (заказанных) Товара (Товаров) на момент принятия заказа в работу
            сотрудник Продавца вправе согласовать с Покупателем замену Товара либо исключить отсутствующий Товар.</p>
          <p>5.3. При получении Продавцом заказа на доставку Товара с Покупателем связывается сотрудник Службы доставки,
            используя способ связи, указанный Покупателем при заказе.</p>
          <p>5.4. Доставка Товара осуществляется в пределах г Ташкента и Ташкентской области в соответствии с адресом,
            указанным Покупателем при оформлении заказа и при условии подтверждения доставки Продавцом. Доставка
            осуществляется в соответствии с датой и временем, согласованными с Покупателем.</p>
          <p>Подтверждение доставки производится Продавцом по телефону.</p>
          <p>5.5. Покупатель согласен принимать на указанные им при регистрации и/или размещении заказа телефонные
            номера звонки операторов и курьеров Продавца и Службы доставки, а также&nbsp;SMS-сообщения и письма по
            электронной почте, по поводу выполнения заказа, а также принимать сообщения по иным указанным средствам
            связи. Покупатель согласен принимать от сотрудника Службы доставки или уполномоченного ею лица заказанный
            Товар по адресу, указанному Покупателем при регистрации и/или размещении заказа.</p>
          <p>5.6. Покупатель в момент заказа обязан предоставить Продавцу и/или Службе доставки максимально точную
            информацию о своем местонахождении по указанному им адресу, а также обеспечить свободный и беспрепятственный
            доступ сотрудника Службы доставки или уполномоченного ею лица по указанному Покупателем адресу.</p>
          <p>5.7. Все материалы, представленные в Интернет-магазине, носят справочный характер и не всегда в полной мере
            передают достоверную информацию о свойствах Товара. Информация, касающаяся потребительских свойств Товаров
            (пищевая и энергетическая ценность, условия хранения, производители ингредиентов и т.д.), указывается на
            основе данных, предоставленных поставщиками. Продавец и Производитель не несет ответственность за ее
            несоответствие реальным характеристикам Товара. Сроки хранения поставленного&nbsp;Товара и ингредиентов,
            входящих в состав Товара, указывается на упаковках. Продавец и Производитель не несут ответственности за
            ущерб, причиненный в ходе нарушения Покупателем указанных условий и сроков хранения приобретенных Товаров и
            ингредиентов.</p>
          <p><br></p>
          <p><br></p>
          <p>КОНФИДЕНЦИАЛЬНОСТЬ</p>
          <p>14.1. Стороны обязуются без обоюдного согласия не передавать третьим лицам, либо использовать иным
            способом, не предусмотренным условиями договора, организационно-технологическую, коммерческую, финансовую и
            иную информацию, составляющую коммерческую тайну для любой из Сторон при условии, что:</p>
          <ul>
            <li>такая информация имеет действительную или потенциальную коммерческую ценность в силу ее неизвестности
              третьим лицам;</li>
            <li>к такой информации нет свободного доступа на законном основании;</li>
            <li>обладатель такой информации принимает надлежащие меры к обеспечению ее конфиденциальности.</li>
          </ul>
          <p>14.2. Срок охраны конфиденциальной информации устанавливается Сторонами не менее одного года со дня
            окончания действия договора Оферты.</p>
        </h3>
    </div>

  </div>
</template>



<style lang="scss">
    .container_oferta {
        max-width: 960px;
        margin: 0 auto;
        padding: 50px;
        background-color: #fff;
        border-radius: 5px;
        
        h1 {
            font-size: 25px;
            font-weight: bold;
            text-align: center;
            margin-bottom: 30px;
        }
        h2 {
            font-size: 24px;
            font-weight: bold;
            margin-top: 20px;
            margin-bottom: 10px;
        }
        p {
            margin-bottom: 20px;
        }
        ul {
            margin-left: 20px;
            margin-bottom: 20px;
        }
        li {
            margin-bottom: 10px;
        }
        a {
            display: inline-block;
            padding: 10px 20px;
            background-color: #007bff;
            color: #fff;
            border-radius: 5px;
            text-decoration: none;
            font-size: 18px;
            margin-top: 20px;
            transition: background-color 0.3s ease;
        }
        a:hover {
            background-color: #0062cc;
        }
    }
</style>